/* ----------------------------------------------------------------------------------------------- */
/*  Copyright (c) 2004 - 2020 by Axel Kenzo, axelkenzo@mail.ru                                     */
/*                                                                                                 */
/*  Файл ak_executable.с                                                                           */
/* ----------------------------------------------------------------------------------------------- */
#include "libakrypt-base.h"
#include "libakrypt.h"

/*! Функция получения массива диапазонов памяти в адресном пространстве исполняемого файла,
 * а также размера данного массива.

    @param filename Имя исполняемого файла.
    @param out_length Указатель на переменную для длины массива.

    @return В случае успеха функция возвращает массив вида:
    (размер секции, начало адреса)                                                                 */
/* ----------------------------------------------------------------------------------------------- */
memory_span *get_executable_memory_spans(const char *filename, size_t  *out_length) {
    memory_span *span_array = NULL;
    return span_array;
}

/* ----------------------------------------------------------------------------------------------- */
/*                                                                                ak_executable.c  */
/* ----------------------------------------------------------------------------------------------- */
